<?php

namespace Database\Seeders;

use App\Models\Committee;
use App\Models\Member;
use App\Models\MemberType;
use App\Models\User;
use Carbon\Carbon;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Hash;

class Member_TypeSeed extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        MemberType::create(['name' => 'المدير']);
        MemberType::create(['name' => 'الرئيس']);
        MemberType::create(['name' => 'عضو اللجنة']);
        MemberType::create(['name' => 'الرئيس الشرفي']);
        MemberType::create(['name' => 'نائب المدير']);
        MemberType::create(['name' => 'رئيس لجنة العلاقات العامة']);
        MemberType::create(['name' => 'رئيس اللجنة الفنية']);
        MemberType::create(['name' => 'رئيس لجنة الإعلام']);
        MemberType::create(['name' => 'رئيس اللجنة المالية']);
        MemberType::create(['name' => 'رئيس لجنة الضيافة و المرافقات']);
        MemberType::create(['name' => 'منسق الفريق الميداني في الطينطان']);

        Committee::create(['name' => "اللجنة العليا", 'description' => "- اللجنة العليا لمهرجان موسيقى الرعاة الدولي هي اللجنة المكلفة بالإدارة التنفيذية للمهرجان وتتألف من رئيس و مدير تنفيذي ومدير مساعدة ورؤساء اللجان المختصة وتهتم بإدارة المهرجان ووضع سياساته العامة بالنظر في المقترحات المقدمة من طرف اللجان الأخرى وإجازتها، ووضع خطط العمل الميداني حسب الزمن، إجازة واعتماد الدراسة الفنية والمالية."]);
        Committee::create(['name' => "لجنة السفراء", 'description' => "سفراء المهرجان عبارة عن مجموعة واسعة من الاصدقاء المثقفين المقيمين في الخارج اساسا والذين يشاركوننا في الايمان والاعجاب بالفكرة وقد عبروا عن استعدادهم لتمثيل المهرجان والتعريف به في مختلف دول العالم. وسيقومون بمساعدتنا في التواصل مع المشاركين والمساهمين والداعمين من البلدان التي يقيمون فيها. بوجودهم معنا وبدورهم القيّم نتوخى الوصول باسرع وقت ممكن الى العالمية من اوسع أبوابها."]);
        Committee::create(['name' => "لجنة العلاقات الخارجية", 'description' => "لجنة العلاقات الخارجية تتشكل من شخصيات وازنة ثقافيا و اجتماعيا تتولى الاتصال المباشر بالمنظمات و المؤسسات و الشخصيات التي قد تساهم ماديا أو معنويا في انجاح المهرجان."]);
        Committee::create(['name' => "اللجنة الإعلامية", 'description' => "تتكون لجنة الإعلام للمهرجان من وحدات متخصصة تعمل كل منها وفق استراتيجية ورؤية شاملة لللجنة وبقدر من المرونة بما يحقق لها قدرة على الحركة للوصول للخبر والمعلومة في الوقت المناسب وبالدقة والمصداقية اللازمة ."]);
        Committee::create(['name' => "اللجنة الفنية", 'description' => "تتكفل هذه اللجنة بتنظيم و إدارة كافة المجالات الفنية للمهرجان ، سينما ، مسرح ، فلكلور، معارض و مسابقات وسباقات المهرجان . و قد عكفت هذه اللجنة منذو شهر أغسطس من العام الماضي على تهيئة النسخة الأولى من المهرجان و ذلك من خلال الرحلات الميدانية والاستكشافية للمنطقه و الإتصال بالفاعلين و المهتدين من الشباب في مجالات الثقافة و الفنون ، حيث تم تقديم دورات تكوينية في مجالي السنما و الفنون التشكيلة."]);
        Committee::create(['name' => "لجنة الضيافة والمرافقات", 'description' => "هي المسؤولة عن استقبال جميع ضيوف المهرجان وطاقمه الفني، وتوفير السكن لهم بالإضافة إلى توفير المعاش والنقل والترفيه طيلة مدة إقامتهم، كما تنظم رحلات سياحية استكشافية لبعض الضيوف من اجل إكتشاف مقدرات المنطقة السياحية."]);
        Committee::create(['name' => "اللجنة المالية", 'description' => "مكلفة بإعداد خطة مالية وترجمتها إلى موازنة قابلة للتنفيذ، يتم إعتمادها من طرف اللجنة العليا، لتوفير التمويل اللازم للمهرجان. كما تسعى إلى إستقطاب الدعم والتمويل اللازم، بالبحث عن الرعاية و الشراكات الممكنة، وذلك بالتعاون مع بعض لجان المهرجان، هي المسؤولة عن تسيير كافة الحسابات من خلال وثائق وسجلات وكشوف قابلة للمراجعة والتدقيق في أي وقت. تعتمد على آلية الصرف طبقًا لبنود الميزانية المعتمدة؛ إلا في حال الاستثناءات التي تحددها اللجنة العليا للمهرجان بقرار مكتوب، كما تتكفل بإعداد تقارير عن الحالة المالية (من إيرادات ومصاريف) يتم تقديمها بشكل دوري."]);
        Committee::create(['name' => "لجنة التنظيم", 'description' => "هي المسؤولة عن تنظيم المهرجان، الزوار والطواقم والفرق كما ستشرف بالتعاون مع اللجنية على كل الأنشطة من ^سهرات، ندوات، محاضرات، وسباقات ومسابقات ومعارض^، في ساحة الفنون ومزرعة فريدي. هي المسؤولة عن امن المهرجان بالتعاون مع فرق الأمن ^الشرطة وغيرها^. ايضا ستشرف على تجهيز وتأثيث القرى النموذجية ^لفريك-لكصر^ وتنظيم زوارهم وانشطتهم."]);
        Committee::create(['name' => "مكتب الطينطان", 'description' => "يشكل مكتب الطينطان ظلا للجنة العليا للمهرجان، وهو  المكلف بالعمل الميداني في الطنيطان؛ ويعمل بالتوازي مع اللجنة الغليا بانواكشوط على التحضير للمهرجان، و كل عضو بالمكتب يمثل إحدى اللجان."]);

        User::create([
            'name'=>'admin',
            'email'=>'admin@gmail.com',
            'email_verified_at'=>Carbon::now(),
            'password'=>Hash::make('admin1234')
        ]);
        Member::create(['name' => 'حمود الددَّ امان', 'image' => 'hamoudDedde.jpg', 'description' => 'حمود الددَّ  امان من مواليد 1997 مقاطعة الطينطان، حاصل على شهادة ختم الدروس الإعدادية 2014 في مدارس الإصلاح الرائد،
حاصل على باكلوريا شعبة العلوم الطبيعية 2017،
خريج المعهد العالي للمحاسبة و إدارة المؤسسات (ISCAE) 2020.
مهتم بالتكنولوجيا و الرسم.', 'tel' => '+22232423704', 'email' => 'hamoudeded@gmail.com', 'committee_id' => 4]);


            Member::create(['name' => 'أدي ابراهيم أسويدأحمد','image' => '/media/members/tq3A7Zeab84OGfmIgGvVYEMJyCmjoa9QapldOAgK.png','description' => 'الدي ولد ابراهيم ولد اسويد أحمد هو أحد ابرز شخصيات البلد منذ الاستقلال. تقلد عدة مناصب وزارية في عهد الرئيس المختار ولد داداه وبعدها تنقل بين عواصم العالم كسفير فوق العادة لبلاده قبل ان يعود للوطن وينتخب عضوا في مجلس الشيوخ لفترة .معينة وقبل كل ذلك يعتبر الدي من الاداريين الأول في البلاد حين عمل كقائد لدائرة الحوض الغربي من عاصمتها "عيون .العتروس". ويعود له الفضل بعيد الاستقلال في التأسيس الاداري لمدينة الطينطان كعاصمة للمقاطعة ولا بد ان ننوه الى ان الدي وهو سليل الامارة الإدوعيشية في تگانت حيث مسقط رأسه وقع في حب البادية منذ شبابه وخاصة بادية ّ أفل في ولاية الحوض الغربي التي ظل ينتجع سهولها ووديانها كمنم اصيل حتى خلال فترات عمله سفيرا مقيما خارج .البلد وحاول في نفس الوقت جلب ادوات الحداثة للمنطقة من تهجين للخيول والابقار وزراعة ممكننة وسينما وفنون .جميلة وحين أدركه الكبر اختار بادية الطينطان سكنا دائما له ولعائلته ولا يزال مقيما مطمئنا بها نسال تعالى له دوام .الصحة وطول العم','tel' => 'unknown','email' => 'unknown@gmail.com','committee_id' => '1','member_type_id' => '4','created_at' => '2021-05-03 02:26:05','updated_at' => '2021-05-03 02:27:33']);
            Member::create(['name' => 'محمد فال أحمد سالم','image' => '/media/members/ngdmBcuiw8DWDZuE2MIVisCjdAWIsVK7gJWhAX50.jpg','description' => 'محمد فال أحمد سالم، دبلوم دراسات عليا أدب إنجليزي من جامعة محمد الخامس في الرباط. صحفي ثم مراسل متجول لشبكة الجزيرة منذ عام 2001. مقيم في الدوحة، قطر. مهتم بالزراعة والبيئة وبفكرة التنمية القاعدية للمجتمع','tel' => '+97455749787','email' => 'vallmohamed83@yahoo.com','committee_id' => '1','member_type_id' => '2','created_at' => '2021-05-03 02:28:38','updated_at' => '2021-05-03 02:28:38']);
            Member::create(['name' => 'حميد ون خرشف','image' => '/media/members/lGD1L0Yc8MRkZJuXreS47Sy7HKW93alHhVxYtGs3.jpg','description' => 'حميد ون خرشف المندوب الجهوي للمكتب الوطني للسياحه في ولاية أنواكشوط الغربية','tel' => '+22236358380','email' => 'unknown@gmail.com','committee_id' => '1','member_type_id' => '1','created_at' => '2021-05-03 02:30:21','updated_at' => '2021-05-03 02:30:21']);
            Member::create(['name' => 'سالم دندو','image' => '/media/members/opPiAiEjQHIOieGfHqcAHjccAD3ab1sqY6yKTjml.jpg','description' => 'سممثل وكاتب مسرحي، منتج ومخرج سينمائي ادار العديد من الفرق والجمعيات الفنية كفرقة مسرح شنقيط في الفترة من (1993 إلى 1997) نادي المسرح الجامعي من (1991 إلى 1994) فرقة المسرح الشعبي من (1994 إلى 1996) التحق بمجال السينما من خلال دار السينمائيين الموريتانيين سنة 2002 حيث عمل بها منتجا ومخرج ثم انتخب أمينا عاما من سنة (2010 الى 2014) فمديرا من سنة (2017 إلى 2021 ) أسس اتحاد السينمائيين الموريتانيين وانتخب رئيسا له سنة 2014','tel' => '+22231494760','email' => 'Salemdendou@gmail.com','committee_id' => '1','member_type_id' => '5','created_at' => '2021-05-03 02:39:17','updated_at' => '2021-05-03 02:39:17']);
            Member::create(['name' => 'محمدو الصلاحي','image' => '/media/members/XFpVnjL6HDtdTAGeQdHPARvJlH3RdPCty7a27m7F.jpg','description' => 'مهندس المعلوماتية والإتصال من جامعة ادويزبورج المانيا كاتب ومؤلف يوميات أغوينتنامو وكتاب أحمد والزرقاء ناشط في حقوق الإنسان','tel' => '+22237003586','email' => 'MohamedouSlahi@gmail.com','committee_id' => '1','member_type_id' => '6','created_at' => '2021-05-03 02:40:48','updated_at' => '2021-05-03 02:40:48']);
            Member::create(['name' => 'سيدي يحي','image' => '/media/members/Qd1myVm64rj2qXFfy0qnV7N3ZIyvF9M23Ry9nKQy.jpg','description' => 'سيدي يحي، فنان تشكيلي يرسم ويقدم أعماله منذو 1987 في موريتانيا السنغال الدول المغاربيه الإمارات سوريا فرنسا واسبانيا. أستاذ مادة الفنون البصرية لأزيد من خمسة عشرة سنة بالمدرسة الأمريكية الدولية بانواكشوط','tel' => '+22236310668','email' => 'sidiyahya@aisnmauritania.com','committee_id' => '1','member_type_id' => '7','created_at' => '2021-05-03 02:41:28','updated_at' => '2021-05-03 02:41:28']);
            Member::create(['name' => 'رئيس لجنة الإعلام','image' => '/media/members/dvqfpDd9sVLO9UyqnZuH8TWbeRAiCNHOzkn97SFm.jpg','description' => 'محمد إدوم شاعر، صحفي، مدير ثقافي ومدرب في مجال إدارة المشاريع والمؤسسات الثقافية، من مواليد 28ديسمبر 1981 في كيفه حاصل على المتريز في الآداب والترجمة من كلية الآداب والعلوم الإنسانية/جامعة نواكشوط وشهادة كأني صحفي السلك العالي المدرسة الوطنية للإدارة والصحافة والقضاء. حاصل على جائزة ملتقى الشارقة للإبداع الشبابي 2012 والمركز الثالث في مسابقة أمير الشعراء 2015 وجائزة شاعر عكاظ في المملكة العربية السعودية 2020. المنسق الثقافي لبيت الشعر- نواكشوط؛ الأمين العام لمجلس خبراء الثقافية بإذاعة موريتانيا؛ صانع محتوى في منصة "ذات" ومركز "إثراء" السعودية؛ عضو الجمعية العمومية ومدرب مشاريع ثقافية لدى مؤسسة المورد الثقافي بلبنان؛ وعضو الهيئة الإستشارية ل -مشروع فجر- السفارة الفرنسية في موريتانيا','tel' => '+22236300773','email' => 'Idoumouabdou@gmail.com','committee_id' => '1','member_type_id' => '8','created_at' => '2021-05-03 02:42:21','updated_at' => '2021-05-03 02:42:21']);
            Member::create(['name' => 'محمد الأمين ابَّجدُّه','image' => '/media/members/rs7OjfCHkuKHLk3v0mu78W86S92AlfxvkG0SMZ1f.jpg','description' => 'من مواليد مقاطعة الطينطان (ولاية الحوض الغربي)، سنة 1969م. مهندس تقنيات بحرية، جريج أكاديمية البحرية التجارية بسوسه (تونس). المدير العام لمجموعة ماكوب (الموريتانية لتجهيز السفن وتسويق الأسماك)، والمتخصصة في مجال الصيد الصناعي ومعالجة وتصدير المنتجات البحرية','tel' => '+(222) 22 36 3063','email' => 'mlemine011@gmail.com','committee_id' => '1','member_type_id' => '9','created_at' => '2021-05-03 02:43:08','updated_at' => '2021-05-03 02:43:08']);
            Member::create(['name' => 'الشيخ سيدي','image' => '/media/members/LfHaTQZONEBII11TMTgqR9r2yDZq5ppdr2HtzU3F.jpg','description' => 'الشيخ سيدي حاصل على ديبلوم دكتورا سلك ثالث في النشاط الإشعاعي والبيئة من جامعة لاس بلماس بإسبانيا. مكلف بمهمة سابقا بوزارة النفط والطاقة والمعادن. الوظيفة الحالية موظف سامي بمنطقة إستثمار نهر السنغال (مدقق داخلي في شركة تسيير واستغلال سد دياما)','tel' => '+22248277965','email' => 'cheikhsidi1@hotmail.com','committee_id' => '1','member_type_id' => '10','created_at' => '2021-05-03 02:44:09','updated_at' => '2021-05-03 02:44:09']);
            Member::create(['name' => 'نوح عيسى','image' => '/media/members/mOeWPlEk9UZlFX6TclSaKvmc3VaaC7bhMfgtPsmb.jpg','description' => 'نوح محمد عبد الله عيسى من مواليد 1991 في الطينطان حاصل على الباكلوريا 2011؛ الليصانص 2015 من جامعة لعيون؛ والماستر 2019؛ خريج المدرسة العليا للتعليم 2015؛ أستاذ اللغة العربية والتربية الإسلامية؛ شارك في عدة ندوات وقدم عدة برامج تلفزيونية عضو لجنة تحكيم شاعر التوحيد 2014 2015 2016','tel' => '+22236915005','email' => 'Medm32601@gmail.com','committee_id' => '1','member_type_id' => '11','created_at' => '2021-05-03 02:45:28','updated_at' => '2021-05-03 02:45:28']);
            Member::create(['name' => 'محمد محمود المصطفى','image' => '/media/members/kn43DYBIkJVS86oals3PMXUEC0Hzu5Y2kqn1QKDl.jpg','description' => 'محمد محمود المصطفى من مواليد 1988 في الطينطان خريج محظرة؛ حاصل على شهادة ميكانيك عامه من مركز التكوين بدار النعيم وفترة تطبيق مع شركة تويوتا موريتانيا 2014-2015. ناشط في الجمعيات الخيرية والثقافية.','tel' => '+22236600714','email' => 'dotch1988.dg@gmail.com','committee_id' => '1','member_type_id' => '12','created_at' => '2021-05-03 02:50:24','updated_at' => '2021-05-03 02:50:24']);
    }
}
